/*ПОВІДОМЛЕННЯ ВІД РОЗРОБНИКА РОЗРОБНИКУ
*Привіт!!! Хочу зізнатися, що я перший раз працював з мультіплеєром. І я з цим не впорався.
*Я знаю, що не зміг реалізувати все, як зазначено в тестовому. У моєму понгу є три найбільших бага,
*які я поки що не знаю як вирішити, а саме:
-Баг з меню, перемикання камери, я пробував робити для меню інший гейм мод, але то ні як не впливає
* на ситуацію, я поняття не маю як це вирішити.
-Баг з підключенням гравця, а саме при підключенні гравець не стає на свою позицію, це робота з сервером ,
* це я теж ніколи не робив і не знаю як.
* Баг який я давно помітив, це швидкість об'єкта - при великій швидкості об'єкт може ігнорувати колізію,
* для цього я зробив костиль у вигляді смертельної зони, і м'яч при контакті з нею, що дивно, повертається просто
* на поле.
* Так, в моєму понгу багато проблем, більша із-за моєї недосвідченості в питанні мултіплеєра, від частини це повідомлення
* спроба отримати цей досвід або хоча б відповіді та поради щодо того як вирішити ці баги.
*
* P.S:
* Потрібно кілька спроб, для того що б гравець правильно підключився до іншого гравця, рідко з першого разу у
* мене виходить підключиться .*/

/*MESSAGE FROM THE DEVELOPER TO THE DEVELOPER
*Hi !!! I want to confess that this is my first time working with multiplayer.
*I know I couldn't implement everything as specified in the test.There are three biggest bugs in my pong ,
*which I don't know how to solve yet,*
*	-Bug with the menu, switch the camera, I tried to do a different game mod for the menu, but it's no way
* I don't know how to solve it.
	-Bug with the connection of the player, namely when you connect a player does not stand on its position, it works with the server,
* I don't know how to fix it.
* I also never did it, I don't know how to do it,
* for that I've made a death zone crutch, and the ball, amazingly, just comes back in contact with it *
* on the field *
* yeah, there's a lot of problems with my pong, a lot of which are due to my inexperience with multiplayer, so that's part of the message *
* trying to get that experience or at least answers and tips on how to solve those bugs.
*
* P.S:
* It takes a few tries, in order for the player to properly connect to another player, rarely from the first time at
* I am able to connect .*/

/*СООБЩЕНИЕ ОТ РАЗРОБОТЧИКА РАЗРАБОТЧИКУ
 *Привет !!! Хочу признаться,что я первый раз работал с мультиплэером.И я с этим не справился.
 *Я знаю что не смог реализовать все как указано в тестовом.В моем понге есть три самых больших бага ,
 *которые я пока что не знаю как решить ,а именно :
 *	-Баг с меню ,переключение камеры ,я пробовал делать для меню другой гейм мод ,но то ни как не влиеет
 *	на ситуацию ,я понятия не имею как это решить .
 *	-Баг с подключением игрока ,а именно при подключении игрок не стает на свою позицию ,это работа с сервером ,
 *	это я тоже никогда не едлал и не знаю как.
 *	-Баг который я давно заметил ,это скорость объекта - при большой скорости обьект может игнорировать коллизию,
 *	для этого я сделал костыль ввиде смертельной зоны ,и мяч при контакте с ней ,что удивительно ,возращается просто
 *	на поле.
 * Да ,в моем понге много проблем ,большая которая из-за моей неопытности в вопросе мултиплэера,от части это сообщение
 * попытка получить этот опыт или хотя бы ответы и советы по тому как решить эти баги.
 *
 * P.S:
 *		Нужно несколько попыток ,для того что бы игрок правильно подключился к другому игроку,редко с первого раза у
 *		меня получается подключится .


